artillery-tests/reports/caching-enabled-high-load-west-us.txt
http.codes.200: ................................................................ 7840
http.codes.201: ................................................................ 490
http.codes.204: ................................................................ 245
http.downloaded_bytes: ......................................................... 2205000
http.request_rate: ............................................................. 186/sec
http.requests: ................................................................. 8575
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 3909
  median: ...................................................................... 198.4
  p95: ......................................................................... 327.1
  p99: ......................................................................... 487.9
http.responses: ................................................................ 8575
plugins.metrics-by-endpoint.DELETE /house/:houseID.codes.204: .................. 245
plugins.metrics-by-endpoint.DELETE /user/:userID.codes.200: .................... 245
plugins.metrics-by-endpoint.GET /house/:houseID.codes.200: ..................... 7350
plugins.metrics-by-endpoint.POST /house.codes.201: ............................. 245
plugins.metrics-by-endpoint.POST /user.codes.201: .............................. 245
plugins.metrics-by-endpoint.POST /user/auth.codes.200: ......................... 245
plugins.metrics-by-endpoint.response_time.DELETE /house/:houseID:
  min: ......................................................................... 109
  max: ......................................................................... 736
  median: ...................................................................... 232.8
  p95: ......................................................................... 368.8
  p99: ......................................................................... 507.8
plugins.metrics-by-endpoint.response_time.DELETE /user/:userID:
  min: ......................................................................... 118
  max: ......................................................................... 596
  median: ...................................................................... 278.7
  p95: ......................................................................... 383.8
  p99: ......................................................................... 432.7
plugins.metrics-by-endpoint.response_time.GET /house/:houseID:
  min: ......................................................................... 1
  max: ......................................................................... 706
  median: ...................................................................... 194.4
  p95: ......................................................................... 290.1
  p99: ......................................................................... 450.4
plugins.metrics-by-endpoint.response_time.POST /house:
  min: ......................................................................... 162
  max: ......................................................................... 639
  median: ...................................................................... 242.3
  p95: ......................................................................... 361.5
  p99: ......................................................................... 441.5
plugins.metrics-by-endpoint.response_time.POST /user:
  min: ......................................................................... 11
  max: ......................................................................... 3909
  median: ...................................................................... 267.8
  p95: ......................................................................... 497.8
  p99: ......................................................................... 2101.1
plugins.metrics-by-endpoint.response_time.POST /user/auth:
  min: ......................................................................... 69
  max: ......................................................................... 645
  median: ...................................................................... 278.7
  p95: ......................................................................... 415.8
  p99: ......................................................................... 528.6
vusers.completed: .............................................................. 245
vusers.created: ................................................................ 245
vusers.created_by_name.House Flow: ............................................. 245
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 7528.9
  max: ......................................................................... 12467.7
  median: ...................................................................... 8520.7
  p95: ......................................................................... 9416.8
  p99: ......................................................................... 9999.2