artillery-tests/reports/caching-enabled-high-load.txt
http.codes.200: ................................................................ 7840
http.codes.201: ................................................................ 490
http.codes.204: ................................................................ 245
http.downloaded_bytes: ......................................................... 2205000
http.request_rate: ............................................................. 223/sec
http.requests: ................................................................. 8575
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 4425
  median: ...................................................................... 67.4
  p95: ......................................................................... 232.8
  p99: ......................................................................... 1022.7
http.responses: ................................................................ 8575
plugins.metrics-by-endpoint.DELETE /house/:houseID.codes.204: .................. 245
plugins.metrics-by-endpoint.DELETE /user/:userID.codes.200: .................... 245
plugins.metrics-by-endpoint.GET /house/:houseID.codes.200: ..................... 7350
plugins.metrics-by-endpoint.POST /house.codes.201: ............................. 245
plugins.metrics-by-endpoint.POST /user.codes.201: .............................. 245
plugins.metrics-by-endpoint.POST /user/auth.codes.200: ......................... 245
plugins.metrics-by-endpoint.response_time.DELETE /house/:houseID:
  min: ......................................................................... 9
  max: ......................................................................... 2841
  median: ...................................................................... 96.6
  p95: ......................................................................... 262.5
  p99: ......................................................................... 584.2
plugins.metrics-by-endpoint.response_time.DELETE /user/:userID:
  min: ......................................................................... 75
  max: ......................................................................... 4425
  median: ...................................................................... 115.6
  p95: ......................................................................... 354.3
  p99: ......................................................................... 889.1
plugins.metrics-by-endpoint.response_time.GET /house/:houseID:
  min: ......................................................................... 0
  max: ......................................................................... 4256
  median: ...................................................................... 62.2
  p95: ......................................................................... 202.4
  p99: ......................................................................... 1002.4
plugins.metrics-by-endpoint.response_time.POST /house:
  min: ......................................................................... 28
  max: ......................................................................... 1297
  median: ...................................................................... 89.1
  p95: ......................................................................... 284.3
  p99: ......................................................................... 889.1
plugins.metrics-by-endpoint.response_time.POST /user:
  min: ......................................................................... 66
  max: ......................................................................... 3706
  median: ...................................................................... 104.6
  p95: ......................................................................... 699.4
  p99: ......................................................................... 1300.1
plugins.metrics-by-endpoint.response_time.POST /user/auth:
  min: ......................................................................... 68
  max: ......................................................................... 2799
  median: ...................................................................... 102.5
  p95: ......................................................................... 278.7
  p99: ......................................................................... 1274.3
vusers.completed: .............................................................. 245
vusers.created: ................................................................ 245
vusers.created_by_name.House Flow: ............................................. 245
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 2076.2
  max: ......................................................................... 8872
  median: ...................................................................... 4492.8
  p95: ......................................................................... 6976.1
  p99: ......................................................................... 7557.1